tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "mhaeuser/mhaeuser"
tap "nikitabobko/tap"
tap "redis/redis"
brew "act"
brew "xz"
brew "zstd"
brew "awscli"
brew "bash"
brew "bat"
brew "carapace"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "consul-template"
brew "coreutils"
brew "deno"
brew "diff-so-fancy"
brew "direnv"
brew "duckdb"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fontforge"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gnu-tar"
brew "libusb"
brew "gnupg"
brew "go"
brew "gum"
brew "htop"
brew "hyperfine"
brew "jq"
brew "kubernetes-cli"
brew "perl"
brew "latexindent"
brew "lazygit"
brew "luarocks"
brew "mkcert"
brew "neovim"
brew "nmap"
brew "nss"
brew "nvm"
brew "onefetch"
brew "pandoc"
brew "pandoc-plot"
brew "pfetch"
brew "pipx"
brew "poppler"
brew "pyenv"
brew "resvg"
brew "ripgrep"
brew "rsync"
brew "sesh"
brew "sevenzip"
brew "starship"
brew "stylua"
brew "taplo"
brew "tmux"
brew "vim"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/envconsul"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "jesseduffield/lazydocker/lazydocker"
cask "aerospace"
cask "alacritty"
cask "basictex"
cask "battery-toolkit"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-victor-mono"
cask "hammerspoon"
cask "jordanbaird-ice"
cask "orbstack"
cask "redis"
cask "sioyek"
cask "skim"
cask "tailscale-app"
vscode "abx.hell-pine"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alphaq1611.rose-prime-theme"
vscode "anthropic.claude-code"
vscode "arrterian.nix-env-selector"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fethalen.papaya"
vscode "foxundermoon.shell-format"
vscode "fredwangwang.vscode-hcl-format"
vscode "gantoreno.anysphere-plus"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hkeric.theme-anysphere"
vscode "ikenshu.rose-noctis"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-go-syntax"
vscode "jeff-hykin.better-js-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "jnoortheen.nix-ide"
vscode "jock.svg"
vscode "juanblanco.solidity"
vscode "kamikillerto.vscode-colorize"
vscode "kodefant.lambda-anysphere"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mindaro-dev.file-downloader"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "msjsdiag.vscode-react-native"
vscode "mvllow.rose-pine"
vscode "oven.bun-vscode"
vscode "pjmiravalle.terraform-advanced-syntax-highlighting"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rexcor.neorose-vimpine"
vscode "rimuruchan.vscode-fix-checksums-next"
vscode "ritwickdey.liveserver"
vscode "romantomjak.go-template"
vscode "rpinski.shebang-snippets"
vscode "rust-lang.rust-analyzer"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "viktorparaj.vague-theme"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yuschick.candy-pine"
go "golang.org/x/tools/gopls"
go "github.com/alexferrari88/sbstck-dl"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "gitui"
